DLLSTART/CyberWand_Insta360/firmware/cyberwand_esp/sdkconfig.defaults
# CyberWand sdkconfig 默认配置

# 目标芯片
CONFIG_IDF_TARGET="esp32c6"

# 串口配置
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0

# USB 串口配置
CONFIG_USB_SERIAL_JTAG_SUPPORT=y

# I2C 配置 (MPU6050)
CONFIG_DRIVER_I2C_ENABLE=y

# 蓝牙配置
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y

# Log 级别
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y

# 分区表
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Flash 大小
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# 优化级别
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 浮点运算支持
CONFIG_NEWLIB_NANO_FORMAT=y
